cask_args appdir: "~/Applications", require_sha: true

# Custom Taps
tap "grafana/homebrew-grafana"
tap "homebrew/cask"
tap "drone/drone"
tap "dagger/tap"

# Cask-based formulae
cask "1password"
cask "docker"
cask "github"
cask "grammarly", args: { require_sha: false }
cask "jasper"
cask "jetbrains-toolbox"
cask "kitty"
cask "slack"
cask "spectacle"
cask "kap"
cask "paw"

# Tooling
brew "awscli"
brew "ack"
brew "autoenv"
brew "az"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "dagger"
brew "direnv"
brew "dnsmasq"
brew "drone"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "goreleaser"
brew "htop"
brew "hub"
brew "jq"
brew "jsonnet"
brew "jsonnet-bundler"
brew "neovim"
brew "pstree"
brew "shellcheck"
brew "terraform"
brew "tig"
brew "tree"
brew "wget"
brew "zsh"

# Databases
brew "postgresql"
brew "redis"
brew "sqlite"

# Languages
brew "go"
brew "node"
brew "rbenv"
brew "rbenv-gemset"
brew "ruby-build"

# Kubernetes
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "stern"

# Google
cask "google-cloud-sdk", args: { require_sha: false }
